app/controllers/check_controller.rb

	def phase1
      @phases= Pstaff.all
---
SELECT `pstaffs`.* FROM `pstaffs`

    def phase2
      @phases= Pstaff.all
---
SELECT `pstaffs`.* FROM `pstaffs`

    def phase3
      @phases= Pstaff.all
---
SELECT `pstaffs`.* FROM `pstaffs`

    def approve
    if current_user.phase1 == true
    	user=Pstaff.find(params[:id])
        user.phase1=true
        user.save
        id =user.user_id
        x = User.find(params[:id])

        NotificationMailer.with(user: x).approve_email.deliver

        redirect_to check_phase1_path
    elsif current_user.phase2 == true
    	user=Pstaff.find(params[:id])
        user.phase2=true
        user.save
        redirect_to check_phase2_path
    elsif current_user.phase3 == true
    	user=Pstaff.find(params[:id])
        user.phase3=true
        user.save
---
SELECT  `pstaffs`.* FROM `pstaffs` WHERE `pstaffs`.`id` = 1 LIMIT 1
UPDATE `pstaffs` SET `phase1` = TRUE, `updated_at` = '2019-05-18 11:12:40' WHERE `pstaffs`.`id` = 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 17 LIMIT 1
SELECT  `pstaffs`.* FROM `pstaffs` WHERE `pstaffs`.`id` = 11 LIMIT 1
UPDATE `pstaffs` SET `phase3` = TRUE, `updated_at` = '2019-05-19 09:34:15' WHERE `pstaffs`.`id` = 11
SELECT  `pstaffs`.* FROM `pstaffs` WHERE `pstaffs`.`id` = 8 LIMIT 1
UPDATE `pstaffs` SET `phase3` = TRUE, `updated_at` = '2019-06-08 16:34:32' WHERE `pstaffs`.`id` = 8