app/controllers/pstaffs_controller.rb

INSERT INTO `pstaffs` (`name`, `gender`, `mobile_no`, `department`, `address`, `registration_certificate_file_name`, `registration_certificate_content_type`, `registration_certificate_file_size`, `registration_certificate_updated_at`, `aadhaar_card_file_name`, `aadhaar_card_content_type`, `aadhaar_card_file_size`, `aadhaar_card_updated_at`, `created_at`, `updated_at`, `user_id`, `vichel_no`, `unique_id`, `RC_holder_name`, `relationship`) VALUES ('nisha', 'female', '9753877133', 'MACS', 'NITK Guest House Bus Stop, Srinivasnagar, Surathkal, Karnataka, India', 'OS_LAB_MANUAL_0.pdf', 'application/pdf', 697572, '2019-05-18 09:35:13', 'OS_LAB_MANUAL_0.pdf', 'application/pdf', 697572, '2019-05-18 09:35:13', '2019-05-18 09:35:13', '2019-05-18 09:35:13', 3, 'MP09AT4525', '174043', 'prakash', 'life')
---
  def create
    @pstaff = current_user.pstaffs.build(pstaff_params)

    respond_to do |format|
      if @pstaff.save

UPDATE `pstaffs` SET `name` = 'prakash sharma', `gender` = '', `unique_id` = '', `vichel_no` = '', `mobile_no` = '07999032788', `department` = 'MACS', `address` = 'NITK Guest House Bus Stop, Srinivasnagar, Surathkal, Karnataka, India', `RC_holder_name` = '', `relationship` = '', `updated_at` = '2019-05-19 05:27:43' WHERE `pstaffs`.`id` = 8
SELECT `users`.* FROM `users`
---
  def update
    respond_to do |format|
      if @pstaff.update(pstaff_params)
        @user = User.all

SELECT  `pstaffs`.* FROM `pstaffs` WHERE `pstaffs`.`id` = 26 LIMIT 1
---
    def set_pstaff
      @pstaff = Pstaff.find(params[:id])